"""
Завдання 4
Напишіть функцію, яка буде аналізувати текст, що надходить до неї,
і виводити тільки унікальні слова на екран, загальну кількість слів і кількість унікальних слів.

"""

import re

my_text = ('День почався дуже добре. Добре світить сонце, добре йти на прогулянку. / '
        'Люди радісні, і це добре. Коли все добре, настрій стає ще кращим')


def simple_text_def(text: str):
        my_words_pattern = r'[А-яЇїІі]+'
        my_find = re.findall(my_words_pattern, text)
        words = [i.lower() for i in my_find]


if __name__ == '__main__':
    simple_text_def(my_text)
